[Retribution X2AbilityTemplate]
LocFriendlyName="Retribution"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range. May cause bleeding."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range. May cause bleeding."
LocFlyOverText="Retribution"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Retribution will trigger if that enemy tries to attack the Skirmisher.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Retribution will trigger when that enemy moves into melee range.<br/><Bullet/>May cause bleeding."

[RetributionAttack X2AbilityTemplate]
LocFriendlyName="Retribution"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range. May cause bleeding."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range. May cause bleeding."
LocFlyOverText="Retribution"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Retribution will trigger if that enemy tries to attack the Skirmisher.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Retribution will trigger when that enemy moves into melee range.<br/><Bullet/>May cause bleeding."

[Reckoning X2AbilityTemplate]
LocFriendlyName="Reckoning"
LocLongDescription="Unlocks the <Ability:SecondaryWeaponName/> Slash attack. May cause bleeding."
LocHelpText="Unlocks the <Ability:SecondaryWeaponName/> Slash attack. May cause bleeding."
LocFlyOverText="Reckoning"
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> A Skirmisher can perform a \"Dash\" move, using both actions to move, and still trigger a Slash against an adjacent enemy.<br/><Bullet/> Slash has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>May cause bleeding."

[SkirmisherMelee X2AbilityTemplate]
LocFriendlyName="Slash"
LocLongDescription="Attack any enemy within movement range with your <Ability:SecondaryWeaponName/>. May cause bleeding."
LocHelpText="Attack an enemy within movement range with your <Ability:SecondaryWeaponName/>. May cause bleeding."
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> A Skirmisher can perform a \"Dash\" move, using both actions to move, and still trigger a Slash against an adjacent enemy.<br/><Bullet/> Slash has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>May cause bleeding."

[Justice X2AbilityTemplate]
LocFriendlyName="Justice"
LocLongDescription="Use the Grapple to pull a humanoid target to you and deliver a <Ability:SecondaryWeaponName/> strike. May cause bleeding."
LocHelpText="Use the Grapple to pull a humanoid target to you and deliver a <Ability:SecondaryWeaponName/> strike. May cause bleeding."
LocPromotionPopupText="<Bullet/> Justice is a great way to pull an enemy out of position.<br/><Bullet/> The <Ability:SecondaryWeaponName/> strike is guaranteed to hit if the pull is successful.<br/><Bullet/> An open space adjacent to the Skirmisher is needed to use Justice.<br/><Bullet/> Justice has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>May cause bleeding."

[SkirmisherVengeance X2AbilityTemplate]
LocFriendlyName="Wrath"
LocLongDescription="Use the Grapple to pull yourself to an enemy and deliver a <Ability:SecondaryWeaponName/> strike. May cause bleeding."
LocHelpText="Use the Grapple to pull yourself to an enemy and deliver a <Ability:SecondaryWeaponName/> strike. May cause bleeding."
LocPromotionPopupText="<Bullet/> Wrath adds extra mobility for the Skirmisher, and can be used while the Grapple is on cooldown.<br/><Bullet/> The <Ability:SecondaryWeaponName/> strike is guaranteed to hit if the Grapple is successful.<br/><Bullet/> An open space adjacent to the enemy is needed to use Wrath.<br/><Bullet/> Wrath has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>May cause bleeding."
